In [2]:
import sqlite3

# Create a connection
conn = sqlite3.connect('example.db')

# Create a cursor
c = conn.cursor()

# Clean tables if they exist
c.execute('''DROP TABLE IF EXISTS students''')

# Create students table
c.execute('''CREATE TABLE students
             (student_id INTEGER PRIMARY KEY,
              name TEXT,
              age INTEGER,
              gender TEXT)''')

# Clean tables if they exist
c.execute('''DROP TABLE IF EXISTS courses''')

# Create courses table
c.execute('''CREATE TABLE courses
             (course_id INTEGER PRIMARY KEY,
              name TEXT,
              instructor TEXT)''')

# Clean tables if they exist
c.execute('''DROP TABLE IF EXISTS enrollments''')

# Create enrollments table
c.execute('''CREATE TABLE enrollments
             (enrollment_id INTEGER PRIMARY KEY,
              student_id INTEGER,
              course_id INTEGER,
              grade TEXT,
              FOREIGN KEY(student_id) REFERENCES students(student_id),
              FOREIGN KEY(course_id) REFERENCES courses(course_id))''')

# Insert data into students table
c.execute("INSERT INTO students (name, age, gender) VALUES ('John Doe', 20, 'Male')")
c.execute("INSERT INTO students (name, age, gender) VALUES ('Jane Smith', 22, 'Female')")
c.execute("INSERT INTO students (name, age, gender) VALUES ('Bob Green', 21, 'Male')")
c.execute("INSERT INTO students (name, age, gender) VALUES ('Lisa Brown', 19, 'Female')")
c.execute("INSERT INTO students (name, age, gender) VALUES ('Tom Lee', 23, 'Male')")

# Insert data into courses table
c.execute("INSERT INTO courses (name, instructor) VALUES ('English 101', 'Mr. Smith')")
c.execute("INSERT INTO courses (name, instructor) VALUES ('Math 101', 'Ms. Johnson')")
c.execute("INSERT INTO courses (name, instructor) VALUES ('Science 101', 'Dr. Green')")
c.execute("INSERT INTO courses (name, instructor) VALUES ('History 101', 'Ms. Brown')")

# Insert data into enrollments table
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (1, 1, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (1, 2, 'B')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (1, 3, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (2, 1, 'B')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (2, 2, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (2, 4, 'C')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (3, 2, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (3, 3, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (4, 1, 'C')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (4, 3, 'B')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (5, 2, 'A')")
c.execute("INSERT INTO enrollments (student_id, course_id, grade) VALUES (5, 4, 'D')")

# Commit the changes
conn.commit()

# Close the connection
conn.close()

In [3]:
# The first step is to CONNECT to the database
#
import sqlite3
import pandas as pd

# Create a connection
conn = sqlite3.connect('example.db')

In [4]:
#1)Write an SQL query to find the names and ages of all female students.
pd.read_sql_query('''SELECT name, age 
FROM students 
WHERE gender = 'Female';''', conn)

         name  age
0  Jane Smith   22
1  Lisa Brown   19

In [5]:
#2)Write an SQL query to find the names of all courses taught by female instructors.
pd.read_sql_query('''SELECT name 
FROM courses 
WHERE instructor 
LIKE '%Ms.%';''', conn)
#As there is no gender column, but mr and ms information, I searched for 'Ms.' containing instructor
#names to find courses taught by female instructors.

          name
0     Math 101
1  History 101

In [6]:
#3)Write an SQL query to find the name and grade of the student with student_id = 2.
pd.read_sql_query('''SELECT students.name, enrollments.grade
FROM students
JOIN enrollments ON students.student_id = enrollments.student_id 
WHERE students.student_id = '2';
''', conn)
#JOIN gives us to add another table ongoing process, as we know we cant work with 2 tables without using that

         name grade
0  Jane Smith     B
1  Jane Smith     A
2  Jane Smith     C

In [7]:
#4)Write an SQL query to find the average age of male students.
pd.read_sql_query('''SELECT AVG(Age) 
FROM Students 
WHERE gender = 'Male';''', conn)

    AVG(Age)
0  21.333333

In [8]:
#5)Write an SQL query to find the names and ages of the three youngest students.
pd.read_sql_query('''SELECT name, age
FROM Students
GROUP BY Age
HAVING COUNT (*) > 0
LIMIT 3''', conn)
#First I made age to make a group comparison, Then i displayed table by having count in ascending order,
#and Limit 3 to only display three youngest ones

         name  age
0  Lisa Brown   19
1    John Doe   20
2   Bob Green   21

In [9]:
#6)Write an SQL query to find the names of students who are enrolled in more than two courses.
pd.read_sql_query('''SELECT students.name
FROM students
JOIN enrollments ON students.student_id = enrollments.student_id
GROUP BY students.student_id, students.name
HAVING COUNT(enrollments.course_id) > 2
''', conn)

         name
0    John Doe
1  Jane Smith

In [10]:
#7) Write an SQL query to find the names of courses and their average grade, sorted in descending order of average grade.
pd.read_sql_query('''SELECT courses.name
FROM courses 
JOIN enrollments on courses.course_id = enrollments.course_id
GROUP BY courses.course_id, courses.name
HAVING COUNT (enrollments.grade) > 0
''', conn)

          name
0  English 101
1     Math 101
2  Science 101
3  History 101

In [11]:
#8)Write an SQL query to find the names of students and the names of courses they are enrolled in, sorted by student name.
pd.read_sql_query('''SELECT students.name, courses.name 
FROM students 
JOIN enrollments ON students.student_id = enrollments.student_id 
JOIN courses ON enrollments.course_id = courses.course_id;
''', conn)

          name         name
0     John Doe  English 101
1     John Doe     Math 101
2     John Doe  Science 101
3   Jane Smith  English 101
4   Jane Smith     Math 101
5   Jane Smith  History 101
6    Bob Green     Math 101
7    Bob Green  Science 101
8   Lisa Brown  English 101
9   Lisa Brown  Science 101
10     Tom Lee     Math 101
11     Tom Lee  History 101

In [12]:
#9)Write an SQL query to find the number of male and female students.
pd.read_sql_query('''SELECT gender, COUNT(*) AS count 
FROM students 
GROUP BY gender;
''', conn)

   gender  count
0  Female      2
1    Male      3

In [13]:
#10)Write an SQL query to find the names of students who are enrolled in both English 101 and Math 101 courses.
pd.read_sql_query('''SELECT students.name
FROM students 
INNER JOIN enrollments ON students.student_id = enrollments.student_id
INNER JOIN courses ON enrollments.course_id = courses.course_id
WHERE courses.name IN ('English 101', 'Math 101')
GROUP BY students.student_id
HAVING COUNT(DISTINCT courses.course_id) = 2;

''', conn)

         name
0    John Doe
1  Jane Smith